{
  "activation_function": "gelu_new",
  "attn_pdrop": 0.1,
  "bos_token_id": 6,
  "embd_pdrop": 0.1,
  "eos_token_id": 7,
  "initializer_range": 0.02,
  "layer_norm_epsilon": 1e-05,
  "model_type": "gpt2",
  "n_embd": 300,
  "n_head": 4,
  "n_inner": null,
  "n_layer": 3,
  "n_positions": 128,
  "reorder_and_upcast_attn": false,
  "resid_pdrop": 0.1,
  "scale_attn_by_inverse_layer_idx": false,
  "scale_attn_weights": true,
  "summary_activation": null,
  "summary_first_dropout": 0.1,
  "summary_proj_to_labels": true,
  "summary_type": "cls_index",
  "summary_use_proj": true,
  "transformers_version": "4.25.1",
  "use_cache": true,
  "vocab_size": 50257
}